# YOLOv8 GSE - 专为 Jetson Nano 优化的工业小零件检测模型
#
# 关键改进：
# 1. Neck 轻量化: GSConv + VoV-GSCSP 替代 Conv + C2f
# 2. 动态上采样: DySample_Simple 替代 nn.Upsample
# 3. 检测头优化: P2-P4 三层检测（移除 P5，增加 P2）
# 4. 保留 SPDConv 和 EMA 增强小目标特征
#
# 目标性能：
# - 参数量: < 2.5M (相比 YOLOv8n 的 3.2M)
# - FLOPs: < 6.0G (相比 YOLOv8n 的 8.7G)
# - mAP50-95: 80%+ (工业小零件数据集)
# - 推理速度: 30+ FPS @ Jetson Nano (FP16)

# 类别数（根据实际数据集修改）
nc: 13  # number of classes

# 缩放系数（保持 nano 规模）
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # nano

# ============================================================================
# Backbone: 特征提取主干网络
# ============================================================================
backbone:
  # P1/2 - 320×320
  - [-1, 1, Conv, [32, 3, 2]]              # 0: stem, /2

  # P2/4 - 160×160 (保留高分辨率特征用于小目标检测)
  - [-1, 1, SPDConv, []]                   # 1: SPD下采样, /4 (输出通道自动 = 输入×4)
  - [-1, 2, C2f, [64, True]]               # 2: 特征提取
  - [-1, 1, EMA, []]                       # 3: EMA 注意力增强 ★

  # P3/8 - 80×80
  - [-1, 1, SPDConv, []]                   # 4: SPD下采样, /8 (输出通道自动 = 输入×4)
  - [-1, 3, C2f, [128, True]]              # 5: 特征提取

  # P4/16 - 40×40
  - [-1, 1, SPDConv, []]                   # 6: SPD下采样, /16 (输出通道自动 = 输入×4)
  - [-1, 3, C2f, [256, True]]              # 7: 特征提取
  - [-1, 1, EMA, []]                       # 8: EMA 注意力增强 ★

  # P5/32 - 20×20 (仅用于特征提取，不输出检测头)
  - [-1, 1, Conv, [512, 3, 2]]             # 9: 标准下采样, /32
  - [-1, 1, C2f, [512, True]]              # 10: 特征提取
  - [-1, 1, SPPF, [512, 5]]                # 11: 空间金字塔池化


# ============================================================================
# Neck: 特征融合网络（轻量化版本）
# ============================================================================
head:
  # ========== 自顶向下路径 (Top-Down) ==========
  
  # P5 -> P4 融合
  - [-1, 1, DySample_Simple, [2]]          # 12: 动态上采样 2x -> 40×40
  - [[-1, 8], 1, Concat, [1]]              # 13: 融合 P4 (layer 8 - EMA输出)
  - [-1, 1, VoVGSCSP, [256, 2]]            # 14: 轻量化融合 ★

  # P4 -> P3 融合
  - [-1, 1, DySample_Simple, [2]]          # 15: 动态上采样 2x -> 80×80
  - [[-1, 5], 1, Concat, [1]]              # 16: 融合 P3 (layer 5)
  - [-1, 1, VoVGSCSP, [128, 2]]            # 17: 轻量化融合 ★

  # P3 -> P2 融合
  - [-1, 1, DySample_Simple, [2]]          # 18: 动态上采样 2x -> 160×160
  - [[-1, 3], 1, Concat, [1]]              # 19: 融合 P2 (layer 3 - EMA输出)
  - [-1, 1, VoVGSCSP, [64, 2]]             # 20: 轻量化融合 ★


  # ========== 自底向上路径 (Bottom-Up) ==========
  
  # P2 -> P3 融合
  - [-1, 1, GSConv, [64, 3, 2]]            # 21: 轻量化下采样 -> 80×80
  - [[-1, 17], 1, Concat, [1]]             # 22: 融合 P3-out (layer 17)
  - [-1, 1, VoVGSCSP, [128, 2]]            # 23: 轻量化融合 ★ (P3-final)

  # P3 -> P4 融合
  - [-1, 1, GSConv, [128, 3, 2]]           # 24: 轻量化下采样 -> 40×40
  - [[-1, 14], 1, Concat, [1]]             # 25: 融合 P4-out (layer 14)
  - [-1, 1, VoVGSCSP, [256, 2]]            # 26: 轻量化融合 ★ (P4-final)


  # ========== 检测头 (Detect Heads) ==========
  # 三层检测: P2 (160×160), P3 (80×80), P4 (40×40)
  # 移除 P5 层以降低计算量，因为工业场景无超大目标
  
  - [[20, 23, 26], 1, Detect, [nc]]        # 27: Detect(P2, P3, P4)


# ============================================================================
# 层级说明 (Layer Index Reference)
# ============================================================================
# 
# Backbone 输出：
#   - Layer 3:  P2 特征 (64 通道, 160×160) + EMA
#   - Layer 5:  P3 特征 (128 通道, 80×80)
#   - Layer 7:  P4 特征 (256 通道, 40×40)
#   - Layer 8:  P4 特征 (256 通道, 40×40) + EMA
#   - Layer 11: P5 特征 (512 通道, 20×20) + SPPF
#
# Neck 输出 (检测头输入)：
#   - Layer 20: P2-final (64 通道, 160×160)
#   - Layer 23: P3-final (128 通道, 80×80)
#   - Layer 26: P4-final (256 通道, 40×40)
#
# ============================================================================


# ============================================================================
# 训练配置建议
# ============================================================================
# 
# train_config:
#   epochs: 200
#   batch: 32  # Jetson Nano 训练用 16，GPU 用 32-64
#   imgsz: 640
#   
#   # 优化器
#   optimizer: AdamW
#   lr0: 0.001
#   lrf: 0.01
#   momentum: 0.9
#   weight_decay: 0.0005
#   
#   # 损失权重（强化小目标）
#   box: 7.5
#   cls: 0.5
#   dfl: 1.5
#   
#   # 数据增强（小目标专用）
#   mosaic: 1.0
#   mixup: 0.1
#   copy_paste: 0.1
#   degrees: 10
#   translate: 0.2
#   scale: 0.9
#   flipud: 0.0
#   fliplr: 0.5
#
# ============================================================================
